Функция ОписаниеПлагина() Экспорт 
	
	Описание = Новый Структура;
	Описание.Вставить("Ключ", "XMLСериализатор");
	Описание.Вставить("Представление", "XML сериализатор");
	Описание.Вставить("Функциональность", Новый Массив);
	
	Описание.Функциональность.Добавить("Сериализация");
	
	Возврат Описание;
	
КонецФункции // ОписаниеПлагина

Функция ПолучитьФорматыСериализации(Тип) Экспорт 

	Форматы = Новый Соответствие;
	Форматы.Вставить("*.xml", "*.xml");
	
	Возврат Форматы;

КонецФункции // ПолучитьФорматыСериализации()

Функция ЕстьПоддержкаСериализации(Тип, Формат) Экспорт 
	
	Возврат Истина;
	
КонецФункции // ЕстьПоддержкаСериализации

Функция СохранитьЗначение(Значение, Формат) Экспорт

	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьXML(Запись, Значение);
	
	Возврат Запись.Закрыть();

КонецФункции // СохранитьЗначение()
