Функция ОписаниеПлагина() Экспорт 
	
	Описание = Новый Структура;
	Описание.Вставить("Ключ", "XMLСериализатор");
	Описание.Вставить("Представление", "XML сериализатор");
	Описание.Вставить("Функциональность", Новый Массив);
	
	Описание.Функциональность.Добавить("Сериализация");
	
	Возврат Описание;
	
КонецФункции // ОписаниеПлагина

Функция ПолучитьФорматыСериализации(Тип) Экспорт 

	Форматы = Новый Соответствие;
	Форматы.Вставить("*.json", "*.json");
	
	Возврат Форматы;

КонецФункции // ПолучитьФорматыСериализации()

Функция ЕстьПоддержкаСериализации(Тип, Формат) Экспорт 
	
	Возврат ВРег(Формат) = "JSON";
	
КонецФункции // ЕстьПоддержкаСериализации

Функция СохранитьЗначение(Значение, Формат) Экспорт

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьJSON(Запись, Значение);
	
	Возврат Запись.Закрыть();

КонецФункции // СохранитьЗначение()

Функция ЗагрузитьЗначение(Строка, Формат, Тип) Экспорт 
	
	Чтение = Новый ЧтениеJSON;
	
	Если ТипЗнч(Строка) = Тип("Строка") Тогда
		
		Чтение.УстановитьСтроку(Строка);
		
	ИначеЕсли ТипЗнч(Строка) = Тип("ДвоичныеДанные") Тогда 
		
		 Чтение.ОткрытьПоток(Строка.ОткрытьПотокДляЧтения());
		 
	КонецЕсли;
	
	Значение = СериализаторXDTO.ПрочитатьJSON(Чтение, Тип);
	
	Чтение.Закрыть();
	
	Возврат Значение;

КонецФункции // ЗагрузитьЗначение
