&НаКлиенте
Перем ПутьФайлаЗапроса;
&НаКлиенте
Перем ТекущаяНастройка;
&НаКлиенте
Перем ХранилищеПараметров;
&НаКлиенте
Перем СтруктураТаблицы;
&НаКлиенте
Перем ТаблицаИзменена;
&НаКлиенте
Перем КлючТекущейНастройки;
&НаКлиенте
Перем ПараметрыТекущейНастройки Экспорт;
&НаКлиенте
Перем РезультатВыполнения;
&НаКлиенте
Перем ИмяФайлаОбработки;
&НаКлиенте
Перем НастройкиОбработки;

//////////////////////////////////////////////////
/////Служебные методы
//////////////////////////////////////////////////

#Область  github_integration

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыПубликации()
	
	Параметры = Новый Структура;

	Параметры.Вставить("owner", "alkoleft");
	Параметры.Вставить("repo", "ones_universal_tools");
	Параметры.Вставить("version", "v1.0.5");
	
	Возврат Параметры;
	
КонецФункции

&НаКлиенте
Функция ПроверитьОбновление()
	
	ПараметрыПубликации = ПараметрыПубликации();
	
	
	Ответ = ПолучитьДанные(СтрШаблон("https://api.github.com/repos/%1/%2/releases/latest", ПараметрыПубликации.owner, ПараметрыПубликации.repo));

	Если Ответ = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	
	Чтение = Новый ЧтениеJSON();	
	Чтение.ОткрытьПоток(Ответ);
	
	Ответ = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	
	Если Ответ["tag_name"] > ПараметрыПубликации.version Тогда 
		
		ИнформацияОВерсии = Новый Структура;
		ИнформацияОВерсии.Вставить("Версия", Ответ["tag_name"]);
		ИнформацияОВерсии.Вставить("Скачать", Ответ["assets"][0]["browser_download_url"]);
		ИнформацияОВерсии.Вставить("Страница", Ответ["html_url"]);
		ИнформацияОВерсии.Вставить("Заголовок", Ответ["name"]);
		ИнформацияОВерсии.Вставить("Описание", Ответ["body"]);
		
		Возврат ИнформацияОВерсии;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьОбновлениеКлиент(Команда = Неопределено)
	ИнформацияОбОбновлении = ПроверитьОбновление();
	
	Если ИнформацияОбОбновлении = Ложь Тогда
		
		ПоказатьПредупреждение(, 
		Новый ФорматированнаяСтрока("У вас последная версия", Новый Шрифт(, 16, )), , 
		"Обновление");
		
	Иначе 
		
		фСтрока = Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока("Доступна новая версия: " + ИнформацияОбОбновлении.Версия, Новый Шрифт(, 16, Истина)),
		Символы.ПС,
		Символы.ПС,
		"Описание: ",
		Новый ФорматированнаяСтрока(
		ИнформацияОбОбновлении.Версия + " " + ИнформацияОбОбновлении.Заголовок, 
		Новый Шрифт(, , Истина), , , 
		ИнформацияОбОбновлении.Страница),
		Символы.ПС,
		Символы.ПС,
		ИнформацияОбОбновлении.Описание,
		Символы.ПС,
		Символы.ПС,
		Новый ФорматированнаяСтрока("Скачать по ссылке(откроется в браузере)", , , , ИнформацияОбОбновлении.Скачать),
		Символы.ПС,
		Символы.ПС,
		Новый ФорматированнаяСтрока("Обновить обработку?", Новый Шрифт(, 14, Истина))
		);
		
		ПоказатьВопрос(
		Новый ОписаниеОповещения("ПроверитьОбновлениеОтвет", ЭтаФорма, ИнформацияОбОбновлении.Скачать)
		, фСтрока
		, РежимДиалогаВопрос.ДаНет
		, , КодВозвратаДиалога.Да
		, "Обновление");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновлениеОтвет(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		
		Данные = СкачатьФайлHTTP(ДополнительныеПараметры);
		
		Если Данные <> Неопределено Тогда 
			
			Данные.Записать(ИмяФайлаОбработки);
			
			ПоказатьПредупреждение(, "Обработка обновлена. Перезапустите обработку");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область  HTTP

&НаКлиенте
Функция СкачатьФайлHTTP(URLФайла)
	
	СтруктураАдреса = РазобратьURL(URLФайла);
	
	Соединение = УстановитьHTTPСоединение(СтруктураАдреса.Сервер, НРег(СтруктураАдреса.Схема) = "https");
	
	Ответ = ВыполнитьHTTPЗапрос(Соединение, СтруктураАдреса.АдресРесурса);
	
	Если Ответ = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Ответ.ПолучитьТелоКакДвоичныеДанные();
	
КонецФункции

&НаКлиенте
Функция ПолучитьДанные(URL, ОтветКак = "Поток")
	
	СтруктураАдреса = РазобратьURL(URL);
	
	Соединение = УстановитьHTTPСоединение(СтруктураАдреса.Сервер, НРег(СтруктураАдреса.Схема) = "https");
	
	Ответ = ВыполнитьHTTPЗапрос(Соединение, СтруктураАдреса.АдресРесурса);
	
	Если Ответ = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если ОтветКак = "Поток" Тогда 
		Возврат Ответ.ПолучитьТелоКакПоток();
	ИначеЕсли ОтветКак = "Строка" Тогда 
		Возврат Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли ОтветКак = "ДвоичныеДанные" Тогда 
		Возврат Ответ.ПолучитьТелоКакДвоичныеДанные();
	Иначе
		Возврат Ответ;
	КонецЕсли;
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция РазобратьURL(Знач URL) Экспорт
	// https://habrahabr.ru/post/232385
	
	СтруктураАдреса = Новый Структура("Схема, Сервер, Порт, Путь, ИмяФайла, АргументыЗапроса, Фрагмент, Пользователь, Пароль, АдресРесурса", 
	"http", , 80, "/");
	
	Позиция = СтрНайти(URL, "://");
	Если Позиция <> 0 Тогда
		
		СтруктураАдреса.Вставить("Схема", Лев(URL, Позиция - 1));
		URL = Сред(URL, Позиция + 3);
		
	КонецЕсли;
	
	Позиция = СтрНайти(URL, "/");
	
	Если Позиция Тогда 
		
		СтруктураАдреса.АдресРесурса = Сред(URL, Позиция + 1);
		
	КонецЕсли;
	
	Позиция = СтрНайти(URL, "#", НаправлениеПоиска.СКонца);
	Если Позиция <> 0 Тогда 
		
		СтруктураАдреса.Фрагмент = Сред(URL, Позиция + 1);
		URL = Лев(URL, Позиция - 1);		
		
	КонецЕсли;
	
	Позиция = СтрНайти(URL, "?", НаправлениеПоиска.СКонца);
	Если Позиция <> 0 Тогда 
		
		СтруктураАдреса.АргументыЗапроса = Сред(URL, Позиция + 1);
		URL = Лев(URL, Позиция - 1);		
		
	КонецЕсли;
	
	Позиция = СтрНайти(URL, "/");
	
	Если Позиция Тогда
		
		СтруктураАдреса.Сервер = Лев(URL, Позиция - 1);
		
		СтруктураАдреса.Путь = Сред(URL, Позиция + 1);
		
		Позиция = СтрНайти(СтруктураАдреса.Путь, "/", НаправлениеПоиска.СКонца);
		
		Если Позиция Тогда 
			
			СтруктураАдреса.ИмяФайла = Сред(СтруктураАдреса.Путь, Позиция + 1);
			
		КонецЕсли;
		
	Иначе
		
		СтруктураАдреса.Сервер = URL;
		
	КонецЕсли;
	
	Позиция = СтрНайти(СтруктураАдреса.Сервер, "@");
	Если Позиция Тогда 
		
		ПользовательПароль = Лев(СтруктураАдреса.Сервер, Позиция - 1);
		СтруктураАдреса.Сервер = Сред(СтруктураАдреса.Сервер, Позиция + 1);
		
		Позиция = СтрНайти(ПользовательПароль, ":");
		СтруктураАдреса.Пользователь = Лев(ПользовательПароль, Позиция - 1);
		СтруктураАдреса.Пароль = Сред(ПользовательПароль, Позиция + 1);
		
	КонецЕсли;
	
	Возврат СтруктураАдреса;
	
КонецФункции

&НаКлиенте
Функция УстановитьHTTPСоединение(Сервер, ИспользоватьSSL)
	
	ЗащищенноеСоединениеOpenSSL = ?(ИспользоватьSSL, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено);
	
	Соединение = Новый HTTPСоединение(Сервер, , , , НастройкиПрокси(), ,	ЗащищенноеСоединениеOpenSSL);
	
	Возврат Соединение;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьHTTPЗапрос(Соединение, АдресРесурса)
	
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния = 302 Тогда // Редирект
		
		Ответ = ПолучитьДанные(Ответ.Заголовки["Location"], Неопределено);
		
	ИначеЕсли Ответ.КодСостояния <> 200 Тогда 
		
		Сообщить("Не удалось выполнить запрос. " + Ответ.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Функция НастройкиПрокси()

	Если НастройкиОбработки = Неопределено ИЛИ НастройкиОбработки["proxy"] = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Прокси = Новый ИнтернетПрокси();
	
	ПараметрыПрокси = НастройкиОбработки["proxy"];
	Сервер = Неопределено;
	Порт = Неопределено;
	Пользователь = Неопределено;
	Пароль = "";
	СтрокаСерверПорт = Неопределено;
	
	Если ПараметрыПрокси = "default" Тогда 
		Возврат Прокси;
	ИначеЕсли ТипЗнч(ПараметрыПрокси) = Тип("Строка") Тогда
		
		СтрокаСерверПорт = ПараметрыПрокси;
		
	ИначеЕсли ТипЗнч(ПараметрыПрокси) = Тип("Соответствие") Тогда 
		
		СтрокаСерверПорт = ПараметрыПрокси["server"];
		Порт 			= ПараметрыПрокси["port"];
		Пользователь 	= ПараметрыПрокси["user"];
		Пароль 			= ПараметрыПрокси["password"];
		
	КонецЕсли;
	
	Если СтрокаСерверПорт <> Неопределено Тогда 
		РазделениеСерверПорт = СтрНайти(ПараметрыПрокси, ":", , , 2);
		Если РазделениеСерверПорт <> 0 Тогда 
			Сервер = Лев(ПараметрыПрокси, РазделениеСерверПорт - 1);
			Порт = Число(Сред(ПараметрыПрокси, РазделениеСерверПорт + 1));
		Иначе
			Сервер = СтрокаСерверПорт;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пользователь) Тогда 
		Прокси.Установить("http", Сервер, Порт, Пользователь, Пароль, Ложь);
		Прокси.Установить("https", Сервер, Порт, Пользователь, Пароль, Ложь);
	Иначе
		Прокси.Установить("http", Сервер, Порт);
		Прокси.Установить("https", Сервер, Порт);
	КонецЕсли;
	
	Возврат Прокси;
КонецФункции

#КонецОбласти //HTTP

#КонецОбласти //github_integration

#Область Универсальные_коллекции

&НаКлиентеНаСервереБезКонтекста
Функция ВыгрузитьЗначения(Коллекция, ИмяРеквизита) Экспорт 
	
	Массив = Новый Массив;
	
	Для Каждого Стр Из Коллекция Цикл 
		
		Массив.Добавить(Стр[ИмяРеквизита]);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДополнитьСтруктуру(Структура, Дополнение, Ключи = Неопределено) Экспорт 
	
	Если Ключи = Неопределено Тогда 
	
		Для Каждого Эл Из Дополнение Цикл 
			
			Структура.Вставить(Эл.Ключ, Эл.Значение);	
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Ключ Из Ключи Цикл 
			
			Структура.Вставить(Ключ, Дополнение[Ключ]);	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Скопировать(Источник, Знач Приемник) Экспорт 
	
	ТипЗ = ТипЗнч(Источник);
	
	Если Приемник = Неопределено Тогда 
		
		Приемник = Новый(ТипЗ);
		
	КонецЕсли;
	
	Если ТипЗ = Тип("Структура") ИЛИ ТипЗ = Тип("Соответствие") Тогда 
		
		Для Каждого Эл Из Источник Цикл 
			
			Приемник.Вставить(Эл.Ключ, Эл.Значение);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗ = Тип("СписокЗначений") Тогда 
		
		Для Каждого Эл Из Источник Цикл 
			ЗаполнитьЗначенияСвойств(Приемник.Добавить(), Эл);
		КонецЦикла;
		
	ИначеЕсли ТипЗ = Тип("ДеревоЗначений") или ТипЗ = Тип("СтрокаДереваЗначений") Тогда
		ПриемникКоллекция = ПолучитьКоллекцию(Приемник);
		ИсточникКоллекция = ПолучитьКоллекцию(Источник);
		
		Для Каждого стр из ИсточникКоллекция цикл
			нСтр = ПриемникКоллекция.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,стр);
			Скопировать(стр, нСтр);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоллекцию(Объект) Экспорт 
	
	Тип = ТипЗнч(Объект);
	Если Тип = Тип("ДеревоЗначений") или Тип = Тип("СтрокаДереваЗначений") Тогда
		Возврат Объект.Строки;
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НайтиВДеревеФормы(ЭлементыДерева, Реквизит, Значение) Экспорт 
	
	Для Каждого Элемент Из ЭлементыДерева Цикл 
		
		Если Элемент[Реквизит] = Значение Тогда 
			
			Возврат Элемент;
			
		Иначе
			
			НСТр = НайтиВДеревеФормы(Элемент.ПолучитьЭлементы(), Реквизит, Значение);
			
			Если НСТр <> Неопределено Тогда 
				
				Возврат НСТр;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеЗапросом(Текст, Параметры) Экспорт 
	Запрос = Новый Запрос(Текст);
	ДополнитьСтруктуру(Запрос.Параметры, Параметры);

	Результат = Запрос.Выполнить();

	Возврат ЗначениеИзРезультатаЗапроса(Результат);

КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеИзРезультатаЗапроса(Результат, ЗначениеПоумолчания = Неопределено, ИмяРеквизита = 0) Экспорт 

	Если Результат.Пустой() Тогда 
		Возврат ЗначениеПоумолчания;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	Возврат Выборка[ИмяРеквизита];

КонецФункции

#КонецОбласти //Универсальные_коллекции

#Область Работа_с_файлами

&НаКлиентеНаСервереБезКонтекста
Функция ФайлСуществует(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	
	Возврат Файл.Существует();
	
КонецФункции

&НаКлиенте
Функция ВыбратьФайлДляСохранения(Фильтр, Заголовок = Неопределено, ВыбранноеИмяФайла = Неопределено, ВыбранныйКаталог = Неопределено, ВыбранноеРасширение = Неопределено)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = Фильтр;
	Диалог.ПолноеИмяФайла 	= ВыбранноеИмяФайла;
	Диалог.Каталог 			= ВыбранныйКаталог;
	Диалог.Заголовок 		= Заголовок;
	Диалог.Расширение 		= ВыбранноеРасширение;
	
	Если Диалог.Выбрать() Тогда
		
		Возврат Диалог.ПолноеИмяФайла;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ВыбратьФайлДляОткрытия(Фильтр, Заголовок = Неопределено, ВыбранноеИмяФайла = Неопределено, ВыбранныйКаталог = Неопределено, ВыбранноеРасширение = Неопределено)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = Фильтр;
	Диалог.ПолноеИмяФайла 	= ВыбранноеИмяФайла;
	Диалог.Каталог 			= ВыбранныйКаталог;
	Диалог.Заголовок 		= Заголовок;
	Диалог.Расширение 		= ВыбранноеРасширение;
		
	Если Диалог.Выбрать() Тогда
		
		Возврат Диалог.ПолноеИмяФайла;
		
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ЗагрузитьФайлНаСервер(Файл)
	
	Если ПустаяСтрока(Файл)Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ФайлСуществует(Файл) Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл не существует. " + Файл;
		Сообщение.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл), УникальныйИдентификатор);
КонецФункции

&НаСервереБезКонтекста
Функция ПоместитьВФайл(Адрес)
	двДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	Если ТипЗнч(двДанные)=Тип("ДвоичныеДанные") Тогда
		ИмяФайла=ПолучитьИмяВременногоФайла();
		двДанные.Записать(ИмяФайла);
		Возврат ИмяФайла;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область Служебные

#Область  Форматирование

&НаКлиентеНаСервереБезКонтекста
Функция ФорматВремяВыполнения(Время)
	Возврат СтрШаблон("%1.%2", Формат('00010101' + Время / 1000, "ДЛФ=T"), Формат(Время % 1000, "ЧЦ=3; ЧН=000; ЧВН="));
КонецФункции

// <TODO необходимо вставить описание>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаКлиенте
Функция ФорматированноеОписание(Структура, ФорматнаяСтрока = Истина)
	
	Если ФорматнаяСтрока Тогда 
		ЖирныйШрифт = Новый Шрифт(Элементы.ДеревоНастроек.Шрифт, , , Истина);
		МассивЭлементов = Новый Массив;
		
		Для Каждого Эл Из Структура Цикл 
			
			МассивЭлементов.Добавить(Новый ФорматированнаяСтрока(Эл.Ключ + ": ", ЖирныйШрифт));
			МассивЭлементов.Добавить(Строка(Эл.Значение) + "; ");
			
		КонецЦикла;
		
		Возврат Новый ФорматированнаяСтрока(МассивЭлементов);
	Иначе
		
		Результат = "";
		
		Для Каждого Эл Из Структура Цикл 
			
			Результат = Результат +
						СтрШаблон("%1: %2;", Эл.Ключ, Эл.Значение) + 
						Символы.ПС;
			
		КонецЦикла;
		
		Возврат Результат;
	КонецЕсли;
	
КонецФункции // ФорматированноеОписание

&НаКлиенте
Функция ФорматированноеОписаниеСписок(Список, ФорматнаяСтрока = Истина)
	
	Если ФорматнаяСтрока Тогда 
		ЖирныйШрифт = Новый Шрифт(Элементы.Настройки_Дерево.Шрифт, , , Истина);
		МассивЭлементов = Новый Массив;
		
		Для Каждого Эл Из Список Цикл 
			Если ЗначениеЗаполнено(эл.Картинка) Тогда 
				МассивЭлементов.Добавить(Эл.Картинка);
			КонецЕсли;				
			
			МассивЭлементов.Добавить(Новый ФорматированнаяСтрока(" " + Эл.Представление + ": ", ЖирныйШрифт));
			МассивЭлементов.Добавить(Строка(Эл.Значение) + "; ");
			
		КонецЦикла;
		
		Возврат Новый ФорматированнаяСтрока(МассивЭлементов);
	Иначе
		
		Результат = "";
		
		Для Каждого Эл Из Список Цикл 
			
			Результат = Результат +
						СтрШаблон("%1: %2;", Эл.Представление, Эл.Значение) + 
						Символы.ПС;
			
		КонецЦикла;
		
		Возврат Результат;
	КонецЕсли;
	
КонецФункции // ФорматированноеОписание

#КонецОбласти //Форматирование

&НаКлиентеНаСервереБезКонтекста
Функция мОшибка(Ошибка, Результат = Неопределено)
	
	Если Результат = Неопределено Тогда 
		Результат = Новый Структура;
	КонецЕсли;
	
	Результат.Вставить("Выполнено", Ложь);
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда 
		Результат.Вставить("Описание", ПодробноеПредставлениеОшибки(Ошибка));
	Иначе
		Результат.Вставить("Описание", Строка(Ошибка));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СообщитьОбОшибке(ОписаниеОшибки, ОписаниеДействия)
		
	фСтрока = Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(?(ЗначениеЗаполнено(ОписаниеДействия), ОписаниеДействия + ". ", "") + "Возникла ошибка:", Новый Шрифт(, 14, Истина)),
		Символы.ПС,
		Символы.ПС,
	    Новый ФорматированнаяСтрока(ОписаниеОшибки, , WebЦвета.Коралловый)
	);
	Сообщить(ОписаниеОшибки);
	ПоказатьПредупреждение(, фСтрока);		
	
КонецПроцедуры // СообщитьОбОшибке

&НаСервереБезКонтекста
Функция ПодключитьВнешнуюОбработкуСервер(Адрес)
	
	Возврат ВнешниеОбработки.Подключить(Адрес);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьТаблицу(ИсточникАдрес)
	
	РезультатТаблица.Очистить();
	СтруктураТаблицы = ЗагрузитьИзВременногоХранилищаТаблицу(ИсточникАдрес);
	РезультатТаблица_Адрес = ИсточникАдрес;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзВременногоХранилищаТаблицу(ИсточникАдрес)

	Таблица = ПолучитьИзВременногоХранилища(ИсточникАдрес);
	Если ИсточникАдрес <> РезультатТаблица_Адрес Тогда 
		ПоместитьВоВременноеХранилище(Таблица, РезультатТаблица_Адрес);
	КонецЕсли;
	Возврат ВывестиТаблицу(Таблица);
	
КонецФункции

&НаСервере
Функция ВывестиТаблицу(Таблица)
	Если Таблица = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ТЗРез = РеквизитФормыВЗначение("РезультатТаблица");
	УдалитьКолонки(ТЗРез.Колонки);

	ТЗРез = Таблица;
	
	СоздатьКолонкиТЗ(ТЗРез.Колонки);
	РезультатТаблица.Загрузить(ТЗРез);
	
	СтруктураТаблицы = Новый Массив;
	
	Для Каждого Колонка Из ТЗРез.Колонки Цикл 
		
		СтруктураТаблицы.Добавить(Новый Структура("Имя, ТипЗначения, Заголовок", Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок));
		
	КонецЦикла;
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Функция ВыполнитьКоманду(ИмяКоманды) Экспорт 
	
	Команда = ЭтаФорма.Команды.Найти(ИмяКоманды);
	Выполнить(Команда.Действие + "(Команда)");
	
КонецФункции

#Область  Замеры

&НаКлиентеНаСервереБезКонтекста
Функция ЗамерСоздать()
	
	Возврат Новый Структура("Выполненные, Текущие", Новый Структура, Новый Структура);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗамерНачало(Имя, ДанныеЗамера)
	
	ДанныеЗамера.Текущие.Вставить(Имя, Новый Структура("Начало, Продолжительность", ТекущаяУниверсальнаяДатаВМиллисекундах()));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗамерЗавершить(Имя, ДанныеЗамера)
		
	ДанныеЗамера.Выполненные.Вставить(Имя, ТекущаяУниверсальнаяДатаВМиллисекундах() - ДанныеЗамера.Текущие[Имя].Начало);
	
	ДанныеЗамера.Текущие.Удалить(Имя);
	
КонецФункции

#КонецОбласти //Замеры

#КонецОбласти

#Область Работа_с_типами

&НаКлиенте
Функция ПолучитьПолноеИмяТипа(Тип)
	
	Если НЕ ХранилищеПараметров.Свойство("КэшТипов") Тогда
		
		ХранилищеПараметров.Вставить("КэшТипов", Новый Соответствие);
		
	КонецЕсли;
	
	Если ХранилищеПараметров.КэшТипов[Тип] = Неопределено Тогда 
		
		ХранилищеПараметров.КэшТипов.Вставить(Тип, ПолучитьПолноеИмяТипаСервер(Тип));
		
	КонецЕсли;
	
	Возврат ХранилищеПараметров.КэшТипов[Тип];
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПолноеИмяТипаСервер(Тип)
	
	Мета = Метаданные.НайтиПоТипу(Тип);
	
	Если Мета <> Неопределено Тогда 
		Возврат Мета.ПолноеИмя();
	Иначе
		Возврат Строка(Тип);
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеТиповВсеСсылки() Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(
	"<TypeDescription xmlns=""http://v8.1c.ru/8.1/data/core"">
	|      <TypeSet xmlns:cc=""http://v8.1c.ru/8.1/data/enterprise/current-config"">cc:AnyRef</TypeSet>
	|</TypeDescription>");
	Результат = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Возврат Результат;
	
КонецФункции

#КонецОбласти //Работа_с_типами

#Область Работа_с_формой

&НаСервере
процедура СоздатьКолонкиТЗ(Колонки)
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Колонка из Колонки Цикл
		Если Колонка.Имя = "_Служебная" Тогда 
			Продолжить;
		КонецЕсли;
		
		РеквизитФормы = Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "NULL"), "РезультатТаблица");
		МассивРеквизитов.Добавить(РеквизитФормы);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
	
	Для Каждого Колонка из Колонки цикл
		Если Колонка.Имя = "_Служебная" Тогда 
			Продолжить;
		КонецЕсли;
		имяКолонки = "РезультатТаблица" + Колонка.Имя;
		Элемент = ЭтаФорма.Элементы.Найти(имяКолонки);
		
		Если Элемент = Неопределено Тогда
			Элемент = ЭтаФорма.Элементы.Добавить(имяКолонки, Тип("ПолеФормы"), Элементы.РезультатТаблица);
			Попытка
				Элемент.ПутьКДанным = "РезультатТаблица." + Колонка.Имя;
			Исключение
			КонецПопытки;
		КонецЕсли;
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.Заголовок = Колонка.Имя;
	КонецЦикла;
	Элементы.РезультатТаблица_Служебная.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонки(Колонки)
	массивУдаляемыхРеквизитов=Новый Массив;	
	Для Каждого Колонка из Колонки цикл
		Если Колонка.Имя = "_Служебная" Тогда 
			Продолжить;
		КонецЕсли;
		массивУдаляемыхРеквизитов.Добавить("РезультатТаблица."+Колонка.Имя);
	КонецЦикла;
	ЭтаФорма.ИзменитьРеквизиты(, массивУдаляемыхРеквизитов);
	Для Каждого Колонка из Колонки цикл
		Если Колонка.Имя = "_Служебная" Тогда 
			Продолжить;
		КонецЕсли;
		имяКолонки="РезультатТаблица" + Колонка.Имя;
		колонкаФ = ЭтаФорма.Элементы.Найти(имяКолонки);
		ЭтаФорма.Элементы.Удалить(колонкаФ);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти //Работа_с_формой

//////////////////////////////////////////////////
/////Основные методы
//////////////////////////////////////////////////

#Область Проверки

&НаКлиенте
Функция МожноВыполнить(ПараметрыНастройки = Неопределено)
	
	Если ПараметрыНастройки = Неопределено Тогда 
		ПараметрыНастройки = ПараметрыТекущейНастройки;
	КонецЕсли;
	
	Если ПараметрыТекущейНастройки = Неопределено ИЛИ (ПараметрыТекущейНастройки.Тип <> 0 И ПараметрыТекущейНастройки.Тип <> 1) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ДоступноРедактированиеНастройки(ПараметрыНастройки = Неопределено) Экспорт 
	
	Если ПараметрыНастройки = Неопределено Тогда 
		ПараметрыНастройки = ПараметрыТекущейНастройки;
	КонецЕсли;
	
	Если ПараметрыНастройки = Неопределено ИЛИ НЕ ПараметрыНастройки.Свойство("ИдентификаторДанные") Тогда 
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область Выполнение

// Выполнение:
//	1.	Проверка возможности выполнения
//	2.	Подготовка контекста выполнения (Параметры, данные таблицы)
//	3.	Вызов методы
//	4.	Обработка результата выполнения
//
// Методы выполнения:
//	Должны возвращать структуру результата:
//		Выполнено - Булево - Признак успешности
//		ВремяВыполнения - Число - Необязательное. Время в милисекундах
//		Данные - ТаблицаЗначений - Результат выполнения
//		ОписаниеРезультатов - Массив - Коллекция результатов, состоящая из структур
//			ВремяВыполнения - Число
//			Данные - ТаблицаЗначений
//		Описание - Строка - Описание ошибки

&НаКлиенте
Функция ВыполнитьНастройку(Знач ПараметрыНастройки = Неопределено) Экспорт
	
	Замер = ЗамерСоздать();
	ЗамерНачало("ОбщееВремя", Замер);
	
	Если ПараметрыНастройки = Неопределено Тогда 
		ПараметрыНастройки = ПараметрыТекущейНастройки;
	КонецЕсли;
	
	Если НЕ МожноВыполнить(ПараметрыНастройки) Тогда 
		
		Возврат Новый Структура("Выполнено, Описание", Ложь, "Нельзя выполнить выбранную настройку");
		
	КонецЕсли;
	
	#Область Подготовка
	
	ТекущиеДанные = ДанныеНастройки(ПараметрыНастройки);
	
	ТипФункции = Неопределено;
	
	Если ПараметрыНастройки.Тип = 0 Тогда 
		
		ТипФункции = "Запрос";
		
	ИначеЕсли ПараметрыНастройки.Тип = 1 Тогда 
		
		ТипФункции = "Алгоритм";
		
	КонецЕсли;
	
	ВыполнитьНаСервере = ТипФункции = "Запрос" ИЛИ НЕ ВыполнятьНаКлиенте;
	ОбновлятьТаблицу = ВыполнитьНаСервере И НЕ ТипФункции = "Запрос" И ТаблицаИзменена = Истина;
	
	ПараметрыВыполнения = Новый Структура;
	
	Для Каждого стр из ТекущиеДанные.ПараметрыЗапроса цикл
		ПараметрыВыполнения.Вставить(стр.ИмяПараметра, стр.ЗначениеПараметра);
	КонецЦикла;
	
	Если ОбновлятьТаблицу Тогда
		
		ЗамерНачало("ПередачаТаблицыНаСервер", Замер);
		
		ПоместитьТаблицуНаСервер(РезультатТаблица, РезультатТаблица_Адрес);
		ТаблицаИзменена = Ложь;
		
		ЗамерЗавершить("ПередачаТаблицыНаСервер", Замер);
		
	КонецЕсли;
	
	#КонецОбласти //Подготовка
		
	Если ВыполнитьНаСервере Тогда 
		
		РезультатВыполнения = ВыполнитьНаСервере(
			ТекущиеДанные.Текст, 
			ПараметрыВыполнения, 
			ТипФункции,
			РезультатТаблица_Адрес);
			
		ДополнитьСтруктуру(Замер.Выполненные, РезультатВыполнения.Замер.Выполненные);
			
		Если РезультатВыполнения.Выполнено И РезультатВыполнения.Свойство("ЕстьДанные") Тогда 
			
			ЗамерНачало("ВремяВывода", Замер);

			ЗагрузитьТаблицу(РезультатВыполнения.АдресДанных);

			ЗамерЗавершить("ВремяВывода", Замер);

		КонецЕсли;
		
	Иначе
		
		Контекст = Новый Структура("Таблица", РезультатТаблица);
		
		РезультатВыполнения = ВыполнитьСкриптНаКлиенте(ТекущиеДанные.Текст, ПараметрыВыполнения, Контекст);		
				
	КонецЕсли;
	
	ЗамерЗавершить("ОбщееВремя", Замер);
	
	РезультатВыполнения.Вставить("Замер", Замер.Выполненные);
	
	ПослеВыполнения();
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПоместитьТаблицуНаСервер(Знач РезультатТаблица, Знач Адрес)
	
	Таблица = ДанныеФормыВЗначение(РезультатТаблица, Тип("ТаблицаЗначений"));
	
	ПоместитьВоВременноеХранилище(Таблица, Адрес);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьНаСервере(Знач Текст, Знач ПараметрыВыполнения, Знач ТипФункции, Знач АдресРезультата)
	
	РезультатВыполнения = Новый Структура("Выполнено, Описание", Истина);
	
	Замер = ЗамерСоздать();
	ЗамерНачало("ВремяВыполнения", Замер);
	
	Попытка
		
		Если ТипФункции = "Запрос" Тогда 
					
			Результат = ВыполнитьЗапросСЗамером(Текст, ПараметрыВыполнения, Истина);
			
		ИначеЕсли ТипФункции = "Алгоритм" Тогда 
			
			Контекст = Новый Структура;
			Контекст.Вставить("Таблица", ПолучитьИзВременногоХранилища(АдресРезультата));
			
			Результат = ВыполнитьСкриптНаСервере(Текст, ПараметрыВыполнения, Контекст);
			
		КонецЕсли;
		
		ОбработкаРезультатВыполнения(Результат);
		
	Исключение
		
		Результат = Новый Структура("Выполнено, Описание", Ложь, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	ЗамерЗавершить("ВремяВыполнения", Замер);
	
	ДополнитьСтруктуру(РезультатВыполнения, Результат);
	
	РезультатВыполнения.Вставить("Замер", Замер);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыполнения()
	
	Замер = РезультатВыполнения.Замер;
	
	Описание = Новый СписокЗначений();
	Описание.Добавить(РезультатТаблица.Количество(), "Строк");
	Описание.Добавить(ФорматВремяВыполнения(Замер.ОбщееВремя), "Время общее");
	
	
	Служебные_ОписаниеРезультат = ФорматированноеОписаниеСписок(Описание);
	
	Если Замер.Свойство("ВремяВыполнения") Тогда 
		Описание.Добавить(ФорматВремяВыполнения(Замер.ВремяВыполнения), "Выполнения");
	КонецЕсли;
	
	Если Замер.Свойство("ВремяВывода") Тогда 
		Описание.Добавить(ФорматВремяВыполнения(Замер.ВремяВывода), "Вывод");
	КонецЕсли;
	
	Элементы.Служебные_ОписаниеРезультат.Подсказка = ФорматированноеОписаниеСписок(Описание, Ложь);

	Если НЕ РезультатВыполнения.Выполнено Тогда 
		
		СообщитьОбОшибке(РезультатВыполнения.Описание, "Выполнение");
		
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Свойство("ОписаниеРезультатов") Тогда 
		
		Результат_ВременныеТаблицы.Очистить();
		Для Каждого Стр Из РезультатВыполнения.ОписаниеРезультатов Цикл 
			
			НовСтр = Результат_ВременныеТаблицы.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
			НовСтр.Время = ФорматВремяВыполнения(НовСтр.Продолжительность);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруЗапроса(Текст)
	
	Схема = Новый СхемаЗапроса();
	
	Схема.УстановитьТекстЗапроса(Текст);
	
	МассивЗапросов = Новый Массив;
	
	Для Каждого Пакет Из Схема.ПакетЗапросов Цикл 
		
		ДанныеЗапроса = Новый Структура;
		
		Если ТипЗнч(Пакет) = Тип("ЗапросВыбораСхемыЗапроса") Тогда 
			ДанныеЗапроса.Вставить("Текст", Пакет.ПолучитьТекстЗапроса());
		Иначе
			ДанныеЗапроса.Вставить("Текст", "УНИЧТОЖИТЬ " + Пакет.ИмяТаблицы);			
		КонецЕсли;
		
		Если ТипЗнч(Пакет) = Тип("ЗапросВыбораСхемыЗапроса") Тогда 
			
			Если ЗначениеЗаполнено(Пакет.ТаблицаДляПомещения) Тогда 
				
				ДанныеЗапроса.Вставить("Тип", "СозданиеВТ");
				ДанныеЗапроса.Вставить("ИмяТаблицы", Пакет.ТаблицаДляПомещения);
				ДанныеЗапроса.Вставить("Имя", Пакет.ТаблицаДляПомещения);
				
			Иначе
				
				ДанныеЗапроса.Вставить("Тип", "Выборка");
				ДанныеЗапроса.Вставить("Имя", "Запрос " + (Схема.ПакетЗапросов.Индекс(Пакет) + 1));
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Пакет) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда 
			
			ДанныеЗапроса.Вставить("Тип", "Уничтожение");
			ДанныеЗапроса.Вставить("ИмяТаблицы", Пакет.ИмяТаблицы);
			ДанныеЗапроса.Вставить("Имя", "~" + Пакет.ИмяТаблицы);
			
		КонецЕсли;
		
		МассивЗапросов.Добавить(ДанныеЗапроса);
	КонецЦикла;
	
	Возврат МассивЗапросов;
	
КонецФункции

#Область Фактическое_выполнение

&НаСервереБезКонтекста
Функция ВыполнитьЗапросСЗамером(ТекстЗапроса, Параметры, СохранятьВТ)
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(ТекстЗапроса);
	
	// [TODO Оптимизация] Добавить анализ параметров, чтоб не передавай каждый раз. Корякин Алексей 18.08.2017 22:09:48
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Для Каждого Параметр из Параметры цикл
		
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		
	КонецЦикла;
	
	ОписаниеРезультатов = Новый Массив;
	
	СозданныеВТ = Новый Соответствие;
	
	Для Каждого Подзапрос Из СтруктураЗапроса Цикл 
		
		ОписаниеРезультат = Новый Структура;
		ОписаниеРезультат.Вставить("Имя", Подзапрос.Имя);
		ОписаниеРезультат.Вставить("Тип", Подзапрос.Тип);
		
		Запрос.Текст = Подзапрос.Текст;
		
		ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
		РезультатЗапроса = Запрос.Выполнить();
		Продолжительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
		
		Если Подзапрос.Тип = "СозданиеВТ" Тогда
			
			Количество = РезультатЗапроса.Выгрузить()[0][0];
			СозданныеВТ.Вставить(ВРег(Подзапрос.ИмяТаблицы), Истина);
			
		ИначеЕсли Подзапрос.Тип = "Выборка" Тогда
			
			ОписаниеРезультат.Вставить("Данные", РезультатЗапроса.Выгрузить());
			Количество = ОписаниеРезультат.Данные.Количество();
			
		ИначеЕсли Подзапрос.Тип = "Уничтожение" Тогда
			
			СозданныеВТ.Удалить(ВРег(Подзапрос.ИмяТаблицы));
			Количество = 0;
			
		КонецЕсли;
		
		ОписаниеРезультат.Вставить("Продолжительность", Продолжительность);
		ОписаниеРезультат.Вставить("Количество", Количество);
		
		ОписаниеРезультатов.Добавить(ОписаниеРезультат);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРезультат Из ОписаниеРезультатов Цикл 
		
		Данные = Неопределено;
		
		Если ОписаниеРезультат.Свойство("Данные") Тогда
			
		ИначеЕсли ОписаниеРезультат.Тип = "СозданиеВТ" И СозданныеВТ[ВРег(ОписаниеРезультат.Имя)] = Истина Тогда 
			
			Запрос.Текст = "ВЫБРАТЬ * ИЗ " + ОписаниеРезультат.Имя;
			Данные = Запрос.Выполнить().Выгрузить();
			
			ОписаниеРезультат.Вставить("Данные", Данные);
			
		КонецЕсли;

	КонецЦикла;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Выполнено", Истина);
	Результат.Вставить("ОписаниеРезультатов", ОписаниеРезультатов);
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьСкриптНаСервере(Знач Текст, Знач Параметры, Знач Контекст)
	
	Возврат ВыполнитьСкрипт(Текст, Параметры, Контекст);
	
КонецФункции

&НаКлиенте
Функция ВыполнитьСкриптНаКлиенте(Знач Текст, Знач Параметры, Знач Контекст)
		
	Возврат ВыполнитьСкрипт(Текст, Параметры, Контекст);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыполнитьСкрипт(Знач Текст, Знач Параметры, Знач Контекст)
	
	ТекстУстановкаКонтекста = "";

	Для Каждого Эл Из Контекст Цикл 
		ТекстУстановкаКонтекста = ТекстУстановкаКонтекста + СтрШаблон("%1 = Контекст.%1;", Эл.Ключ);	
	КонецЦикла;
	
	Результат = Неопределено;

	Попытка
		
		Выполнить(ТекстУстановкаКонтекста + Текст);
		
	Исключение
		
		Возврат Новый Структура("Выполнено, Описание", Ложь, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
		
	Возврат Новый Структура("Выполнено, Данные", Истина, Результат);
	
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбработкаРезультатВыполнения(Результат)
	
	Если НЕ Результат.Выполнено Тогда 
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если Результат.Свойство("ОписаниеРезультатов") Тогда 
	
		Для Каждого ОписаниеРезультат Из Результат.ОписаниеРезультатов Цикл 
			
			Если ОписаниеРезультат.Свойство("Данные") И ОписаниеРезультат.Данные <> Неопределено Тогда
				
				АдресДанных = ПоместитьВоВременноеХранилище(ОписаниеРезультат.Данные, Новый УникальныйИдентификатор);
				ОписаниеРезультат.Удалить("Данные");
				ОписаниеРезультат.Вставить("АдресДанных", АдресДанных);
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Результат.Свойство("Данные") И Результат.Данные <> Неопределено Тогда
			
		АдресДанных = ПоместитьВоВременноеХранилище(Результат.Данные, Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресДанных) Тогда
		
		Результат.Вставить("АдресДанных", АдресДанных);
		Результат.Вставить("ЕстьДанные", Истина);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти //Фактическое_выполнение

#КонецОбласти

#Область  Функции_скрипта_клиент

&НаКлиенте
Функция ПодключитьВнешнуюОбработку(ИмяФайла)
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
	Возврат ПодключитьВнешнуюОбработкуСервер(Адрес);
	
КонецФункции

&НаКлиенте
Функция ОткрытьВнешнуюОбработку(ИмяФайла, ПараметрыФормы = Неопределено)
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
	ИмяОбработки = ПодключитьВнешнуюОбработкуСервер(Адрес);
	
	ОткрытьФорму(СтрШаблон("ВнешняяОбработка.%1.Форма", ИмяОбработки), ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

#КонецОбласти //Функции_скрипта_клиент

#Область Редактирование_Текстов

&НаКлиенте
Функция УстановитьТекст(Текст) Экспорт 
	
	Если НЕ ДоступноРедактированиеНастройки() Тогда 
		
		ВызватьИсключение "Редактирование текущей настройки не доступно";
		
	КонецЕсли;
	
	ВыбраннаяНастройка_Текст.УстановитьТекст(Текст);
	
	Возврат СохранитьДанныеНастройки();
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииКЗ(Текст, ДополнительныеПараметры) Экспорт 
	Если Текст = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ВыбраннаяНастройка_Текст.УстановитьТекст(Текст);
КонецПроцедуры

#Область Обработка_запроса
//удаляет из текста запроса всю шнягу которая там при переносе из модуля 
//(палки, кавычки, точки с запятой)
&НаКлиенте
Функция обПропылесоситьТекстЗапроса(ИсходныйТекст) Экспорт
	
	ИсходныйТекст = СокрЛП(ИсходныйТекст);
	
	//вертипалки
	ОбработанныйТекст	=	СтрЗаменить(ИсходныйТекст,"|","");
	
	//открывающая кавычка
	Пока Лев(ОбработанныйТекст,1) = Символ(34) Цикл
		ОбработанныйТекст = Сред(ОбработанныйТекст,2);
		//закрывающая кавычка удаляется только если была открывающая
		//иначе может быть глюк со строковым выражением в запросе
		Пока Прав(ОбработанныйТекст,1) = Символ(34) Цикл
			ОбработанныйТекст = Сред(ОбработанныйТекст,1,СтрДлина(ОбработанныйТекст)-1);
		КонецЦикла; 
	КонецЦикла; 
	//закрывающая точка с запятой
	Если Прав(ОбработанныйТекст,1) = ";" Тогда
		ОбработанныйТекст = Сред(ОбработанныйТекст,1,СтрДлина(ОбработанныйТекст)-1);
	КонецЕсли; 
	
	//двойные кавычки надо заменить на одинарные
	//Строка2Кавычки = Символ(34) + Символ(34);
	//Строка1Кавычка = Символ(34);
	
	//ОбработанныйТекст	=	СтрЗаменить(ОбработанныйТекст,Строка2Кавычки,Строка1Кавычка);
	
	Возврат ОбработанныйТекст;
	
КонецФункции //обПропылесоситьТекстЗапроса

&НаСервереБезКонтекста
Функция ПроверкаПередВыполнением(ТекстЗапроса)
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		
		Возврат мОшибка("Не заполнен текст запроса!");
		
	КонецЕсли;
		
	Попытка
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.НайтиПараметры();
		
	Исключение
		
		Возврат мОшибка(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Новый Структура("Успешно", Истина);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьТекстДляМодуля(ТекстЗапроса)
	
	ТекстМодуля = ТекстЗапроса;
	
	//одинарные кавычки надо заменить на двойные
	Строка2Кавычки = Символ(34) + Символ(34);
	Строка1Кавычка = Символ(34);
	ТекстМодуля	=	СтрЗаменить(ТекстМодуля, Строка1Кавычка, Строка2Кавычки);
	
	//открывающие и закрывающие 
	ТекстМодуля = Символ(34) + ТекстМодуля + Символ(34) + ";";
	
	
	ТекстДок = Новый ТекстовыйДокумент; 
	ТекстДок.УстановитьТекст(ТекстМодуля);
	
	Для сч = 2 по ТекстДок.КоличествоСтрок() Цикл
		Строка = ТекстДок.ПолучитьСтроку(сч);
		ТекстДок.ЗаменитьСтроку(сч,"|"+Строка);
	КонецЦикла;  
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант1",Символы.ВК+ТекстДок.ПолучитьТекст());
	
	ТекстДок.ВставитьСтроку(0, 	
	"Запрос = Новый Запрос;
	|Запрос.Текст = 
	|" );
	
	
	//Для каждого СтрокаПараметров Из ПараметрыЗапроса Цикл
	//	ТекстПеременной = СформироватьСтрокуПолученияСсылкиПоГУИД(СтрокаПараметров.ЗначениеПараметра);
	//	ТекстМодуля = ТекстМодуля + Символы.ПС + "Запрос.УстановитьПараметр(" + Строка1Кавычка + СокрЛП(СтрокаПараметров.ИмяПараметра) + Строка1Кавычка + ", " + ТекстПеременной + ");"
	//КонецЦикла; 
	//
	//ТекстМодуля = ТекстМодуля + Символы.ПС + "Результат = Запрос.Выполнить();";
	//СтруктураПараметров.Вставить("Вариант2",Символы.ВК + ТекстМодуля);
	//ОткрытьФормуСовместимость82(мПутьКОбработке+".ВариантыЗапросаДляБуфераУпр",СтруктураПараметров);
	
	Возврат ТекстДок;
КонецФункции

&НаКлиенте
Процедура ВыбраннаяНастройка_ТекстПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗакомментироватьВыделенныйТекст()
	Перем СтрНач,СтрКон,КолНач,КолКон;
	
	Элементы.ВыбраннаяНастройка_Текст.ПолучитьГраницыВыделения(СтрНач, КолНач, СтрКон, КолКон);
		
	Для сч = СтрНач по СтрКон Цикл
		НовСтрока = "//" + ВыбраннаяНастройка_Текст.ПолучитьСтроку(сч);
		ВыбраннаяНастройка_Текст.ЗаменитьСтроку(сч, НовСтрока);
	КонецЦикла;  
	
	ХранилищеПараметров.Вставить("ГраницыВыделения", Новый Структура("СтрНач, КолНач, СтрКон, КолКон", СтрНач, КолНач, СтрКон, КолКон));
	
	УстановитьГраницыВыделения();
	ПодключитьОбработчикОжидания("УстановитьГраницыВыделения", 0.1, Истина);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГраницыВыделения()
	
	ГраницыВыделения = ХранилищеПараметров.ГраницыВыделения;
	Элементы.ВыбраннаяНастройка_Текст.УстановитьГраницыВыделения(ГраницыВыделения.СтрНач, ГраницыВыделения.КолНач, ГраницыВыделения.СтрКон, ГраницыВыделения.КолКон);
	
КонецПроцедуры

&НаКлиенте
Процедура РасКомментироватьВыделенныйТекст()
	Перем СтрНач,СтрКон,КолНач,КолКон;
	
	Элементы.ВыбраннаяНастройка_Текст.ПолучитьГраницыВыделения(СтрНач,КолНач,СтрКон,КолКон);
	
	Текст = ВыбраннаяНастройка_Текст;
	
	Для сч = СтрНач по СтрКон Цикл
		СтарСтрока = Текст.ПолучитьСтроку(сч);
		Если Не Лев(СтарСтрока,2) = "//" Тогда Продолжить КонецЕсли; 
		
		НовСтрока = Сред(СтарСтрока, 3, СтрДлина(СтарСтрока));
		Текст.ЗаменитьСтроку(сч, НовСтрока);
	КонецЦикла; 
		
	ХранилищеПараметров.Вставить("ГраницыВыделения", Новый Структура("СтрНач, КолНач, СтрКон, КолКон", СтрНач, КолНач, СтрКон, КолКон));
	
	УстановитьГраницыВыделения();
	ПодключитьОбработчикОжидания("УстановитьГраницыВыделения", 0.1, Истина);
	
	Модифицированность = Истина;
	
КонецПроцедуры


#КонецОбласти //Обработка_запроса

#КонецОбласти

#Область Параметры

&НаСервереБезКонтекста
Функция Параметры_ЗаполнитьНаСервере(ТекстЗапроса)
	
	мПараметры = Новый Массив;
	
	Попытка
		Запрос = Новый Запрос(ТекстЗапроса);
	Исключение
		
		Возврат Новый Структура("Выполнено, Описание", Ложь, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Для Каждого Параметр Из Запрос.НайтиПараметры() Цикл 
		
		мПараметры.Добавить(Новый Структура("Имя, ТипЗначения", Параметр.Имя, Параметр.ТипЗначения));
		
	КонецЦикла;
	
	Возврат Новый Структура("Выполнено, Параметры", Истина, мПараметры);
	
КонецФункции

&НаКлиенте
Процедура Параметры_ЗаполнитьНаКлиенте()
		
	ТекстЗапроса = ВыбраннаяНастройка_Текст.ПолучитьТекст();
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда 
		Возврат;
	КонецЕсли;
	
	
	Результат = Параметры_ЗаполнитьНаСервере(ТекстЗапроса);
	
	Если НЕ Результат.Выполнено Тогда 
		
		СообщитьОбОшибке(Результат.Описание, "При получении параметров запроса");
		Возврат;
		
	КонецЕсли;
	
	ПараметрыЗапроса = ВыбраннаяНастройка_Параметры;
	
	Для Каждого Параметр Из Результат.Параметры Цикл 
		
		Строки = ПараметрыЗапроса.НайтиСтроки(Новый Структура("ИмяПараметра", Параметр.Имя));
		
		Если Строки.Количество() = 0 Тогда 
			
			Стр = ПараметрыЗапроса.Добавить();
			Стр.ИмяПараметра = Параметр.Имя;
			
		Иначе
			
			Стр = Строки[0];
			
		КонецЕсли;
		Стр.ТипПараметра = Параметр.ТипЗначения;
		Стр.ЗначениеПараметра = Параметр.ТипЗначения.ПривестиЗначение(Стр.ЗначениеПараметра);
		
	КонецЦикла;
	
	Модифицированность = Истина;
	
	СохранитьДанныеНастройки(ПараметрыТекущейНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПараметра(Имя, Значение, ТипЗначения = Неопределено)
	ПараметрыЗапроса = ВыбраннаяНастройка_Параметры;
	
	Строки = ПараметрыЗапроса.НайтиСтроки(Новый Структура("ИмяПараметра", Имя));
	
	Если Строки.Количество() = 0 Тогда 
		
		Стр = ПараметрыЗапроса.Добавить();
		Стр.ИмяПараметра = Имя;
		
	Иначе
		
		Стр = Строки[0];
		
	КонецЕсли;
	Если ТипЗначения <> Неопределено Тогда 
		Стр.ТипПараметра = ТипЗначения;
	КонецЕсли;
	
	Если Значение = Неопределено Тогда 
		Стр.ЗначениеПараметра = ТипЗначения.ПривестиЗначение(Стр.ЗначениеПараметра);
	Иначе
		Стр.ЗначениеПараметра = Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияПараметров(ЗначенияПараметров) Экспорт 
	
	Для Каждого Эл из ЗначенияПараметров Цикл 
		
		УстановитьЗначениеПараметра(Эл.Ключ, Эл.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти //Параметры

#Область Настройки

// [TODO Оптимизация] Реализовать безконтекстное сохранение/загрузку. Корякин Алексей 30.07.2017 12:03:45
&НаСервере
Процедура ЗагрузитьНастройкиНаСервере(Адрес)
	
	ИмяФайла = ПоместитьВФайл(Адрес);	
	Если ИмяФайла=Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	вНастройки = ЗначениеИзФайла(ИмяФайла);
	УдалитьФайлы(ИмяФайла);
	
	
	Если ТипЗнч(вНастройки) = Тип("Структура") Тогда 
		
		Настройки_Дерево.ПолучитьЭлементы().Очистить();
		Дерево = РеквизитФормыВЗначение("Настройки_Дерево");
		
		Скопировать(вНастройки.Дерево, Дерево);
		ЗначениеВРеквизитФормы(Дерево,"Настройки_Дерево");
		
		ЗначениеВРеквизитФормы(вНастройки.Алгоритмы, "Настройки_Алгоритмы");
		ЗначениеВРеквизитФормы(вНастройки.Запросы, "Настройки_Запросы");
		
	КонецЕсли;
	
	УстановитьКартинкуНастройки(Настройки_Дерево.ПолучитьЭлементы());
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКартинкуНастройки(Элементы)
	
	Для Каждого Элемент Из Элементы Цикл 
		
		Элемент.Картинка = КартинкаПоТипуНастройки(Элемент.Тип);
		УстановитьКартинкуНастройки(Элемент.ПолучитьЭлементы());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресФайлаНастроек()
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	СохранитьНастройкиНаСервере(ИмяФайла);
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла), УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат Адрес;
КонецФункции

&НаСервере
Функция СохранитьНастройкиНаСервере(ИмяФайла)
	
	ЗначениеВФайл(ИмяФайла, Новый Структура("Дерево, Запросы, Алгоритмы",
		РеквизитФормыВЗначение("Настройки_Дерево"),
		РеквизитФормыВЗначение("Настройки_Запросы"),
		РеквизитФормыВЗначение("Настройки_Алгоритмы"),
	));
	
	// ЗначениеВФайл(ИмяФайла, РеквизитФормыВЗначение("ДеревоНастроек"));
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьДанныеНастройки(ПараметрыНастройки)
	
	
	Стр = ДанныеНастройки(ПараметрыНастройки);
	
	Если Стр = Неопределено Тогда 
		
		ВыбраннаяНастройка_Текст.Очистить();
		Возврат;
		
	КонецЕсли;
	
	ВыбраннаяНастройка_Текст.УстановитьТекст(Стр.Текст);
	
	ВыбраннаяНастройка_Параметры.Очистить();
	Для Каждого Параметр Из Стр.ПараметрыЗапроса Цикл 
		
		ЗаполнитьЗначенияСвойств(ВыбраннаяНастройка_Параметры.Добавить(), Параметр);

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СохранитьДанныеНастройки(ПараметрыНастройки = Неопределено) Экспорт 
	
	Если ПараметрыНастройки = Неопределено Тогда 
		ПараметрыНастройки = ПараметрыТекущейНастройки;
	КонецЕсли;
	
	Если НЕ ДоступноРедактированиеНастройки(ПараметрыНастройки) Тогда 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	
	Стр = ТаблицаНастроек(ПараметрыНастройки.Тип).НайтиПоИдентификатору(ПараметрыНастройки.ИдентификаторДанные);
	
	Стр.Текст = ВыбраннаяНастройка_Текст.ПолучитьТекст();
	Стр.ПараметрыЗапроса.Очистить();
	
	Для Каждого Параметр Из ВыбраннаяНастройка_Параметры Цикл 
		
		ЗаполнитьЗначенияСвойств(Стр.ПараметрыЗапроса.Добавить(), Параметр);

	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяФайлаОбработки()
	
	Возврат РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;
	
КонецФункции

&НаКлиенте
Функция НайтиЗагрузитьНастройкиОбработки()
	
	ИмяФайлаОбработки = ПолучитьИмяФайлаОбработки();
	
	Файл = Новый Файл(ИмяФайлаОбработки);
	Если НЕ ФайлСуществует(Файл.Путь + "config.json") Тогда 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Попытка
		
		Чтение = Новый ЧтениеJSON();
		Чтение.ОткрытьФайл(Файл.Путь + "config.json");
		НастройкиОбработки = ПрочитатьJSON(Чтение, Истина);
		Чтение.Закрыть();
		
	Исключение
		
		СообщитьОбОшибке(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), "Загрузка настроек обработки");
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область  Получение_настроек

&НаКлиенте
Функция ТаблицаНастроек(Тип)
	Если Тип = 0 Тогда 
		
		Возврат Настройки_Запросы;
		
	ИначеЕсли Тип = 1 Тогда 
		
		Возврат Настройки_Алгоритмы;
		
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ДанныеНастройки(ПараметрыНастройки) Экспорт 
	Если ПараметрыНастройки = Неопределено ИЛИ НЕ ПараметрыНастройки.Свойство("ИдентификаторДанные") Тогда 
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат ТаблицаНастроек(ПараметрыНастройки.Тип).НайтиПоИдентификатору(ПараметрыНастройки.ИдентификаторДанные);
	
КонецФункции

&НаКлиенте
Функция ПолучитьПараметрыНастройки(КлючНастройки)
	
	Если КлючНастройки = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
		
	СтрН = НайтиВДеревеФормы(Настройки_Дерево.ПолучитьЭлементы(), "Ключ", КлючНастройки);
	
	Если СтрН = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	Результат = Новый Структура;
	
	Результат.Вставить("Ключ", КлючНастройки);
	Результат.Вставить("Тип", СтрН.Тип);
	Результат.Вставить("Идентификатор", СтрН.ПолучитьИдентификатор());
	
	ТаблицаДанные = ТаблицаНастроек(СтрН.Тип);
	
	Если ТаблицаДанные <> Неопределено Тогда 
		Строки = ТаблицаДанные.НайтиСтроки(Новый Структура("Ключ", КлючНастройки));
		
		Результат.Вставить("ИдентификаторДанные", Строки[0].ПолучитьИдентификатор());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Добавить настройку
//
// Параметры:
//  Тип	 - Число	 - 0 - Запрос, 1 - Скрипт, 9 -Группа
// 
// Возвращаемое значение:
//   - 
//
&НаКлиенте
Функция ДобавитьНастройку(Тип)
	
	Модифицированность = Истина;
	
	Если ПараметрыТекущейНастройки <> Неопределено И ПараметрыТекущейНастройки.Тип = 9 Тогда 
		
		Родитель = Настройки_Дерево.НайтиПоИдентификатору(ПараметрыТекущейНастройки.Идентификатор);
		
	Иначе
		
		Родитель = Настройки_Дерево;
		
	КонецЕсли;
	
	Стр = Родитель.ПолучитьЭлементы().Добавить();
	Стр.Тип = Тип;
	Стр.Ключ = Новый УникальныйИдентификатор;
	Стр.Картинка = КартинкаПоТипуНастройки(Тип);
	
	Если Тип = 0 Тогда
		
		СтрДанные = Настройки_Запросы.Добавить();
		
	ИначеЕсли Тип = 1 Тогда 
		
		СтрДанные = Настройки_Алгоритмы.Добавить();
		
	КонецЕсли;
	
	Если СтрДанные <> Неопределено Тогда 
		СтрДанные.Ключ = Стр.Ключ;
	КонецЕсли;
	
	Элементы.Настройки_Дерево.ТекущаяСтрока = Стр.ПолучитьИдентификатор();
	
КонецФункции

#КонецОбласти //Получение_настроек

//////////////////////////////////////////////////
/////Интерфейсные методы, обработчики команд
//////////////////////////////////////////////////


#Область Форма

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонсольКода_ЗагрузитьИзВременногоХранилища" Тогда 
		Сообщить("Адрес данных: " + Параметр);
		ЗагрузитьТаблицу(Параметр);
		
		Если ТипЗнч(Источник) = Тип("УправляемаяФорма") И Источник.Открыта() Тогда 
			Источник.Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовок()
	
	Заголовок = "Консоль кода. " + 
		ПараметрыПубликации()["version"] + 
		?(ПустаяСтрока(ИмяФайлаНастроек), "", ": " + ИмяФайлаНастроек);
	
КонецПроцедуры

#Область События

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда 
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросаПриЗакрытии", ЭтотОбъект), "Настройки не сохранены. Закрыть?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаПриЗакрытии(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		
		Модифицированность = Ложь;
		ЭтотОбъект.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НайтиЗагрузитьНастройкиОбработки();
	
	ХранилищеПараметров = Новый Структура;
	
	Если НЕ ПустаяСтрока(ИмяФайлаНастроек)Тогда 
		Адрес = ЗагрузитьФайлНаСервер(ИмяФайлаНастроек);
		
		Если ЭтоАдресВременногоХранилища(Адрес) Тогда 
			ЗагрузитьНастройкиНаСервере(Адрес);
		КонецЕсли;
	Иначе
		
		ДобавитьНастройку(0);
		Модифицированность = Ложь;
		
	КонецЕсли;
	УстановитьЗаголовок();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РезультатТаблица_Адрес = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Команды

#Область Настройки

&НаКлиенте
Функция НоваяНастройка(Команда = Неопределено) Экспорт 
	
	ОчиститьНастройки();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	ИмяВыбранногоФайла = ВыбратьФайлДляОткрытия(
		"Файлы запросов (*.sel)|*.sel|Все файлы (*.*)|*.*",
		"Укажите файл Для списка запросов",
		ИмяФайлаНастроек,
		ПутьФайлаЗапроса,
		"sel"
	);
	
	ЗагрузитьНастройкиИзФайла(ИмяВыбранногоФайла);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьДанныеНастройки(ПараметрыТекущейНастройки);
	
	Если Команда.Имя = "Файл_СохранитьНастройкиКак" ИЛИ ПустаяСтрока(ИмяФайлаНастроек) Тогда 
		ИмяВыбранногоФайла = ВыбратьФайлДляСохранения(
			"Файлы запросов (*.sel)|*.sel|Все файлы (*.*)|*.*",
			"Укажите файл Для списка запросов",
			ИмяФайлаНастроек,
			ПутьФайлаЗапроса,
			"sel"
		);
		
		СохранитьНастройкуВФайл(ИмяВыбранногоФайла);

	Иначе
		
		СохранитьНастройкуВФайл(ИмяФайлаНастроек);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьНастройкиИзФайла(ИмяВыбранногоФайла) Экспорт 
	
	Если ИмяВыбранногоФайла = Неопределено Тогда 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ПараметрыТекущейНастройки = Неопределено;
	
	Адрес = ЗагрузитьФайлНаСервер(ИмяВыбранногоФайла);
	Если НЕ ЭтоАдресВременногоХранилища(Адрес) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЗагрузитьНастройкиНаСервере(Адрес);
	
	ПослеСохраненияИлиЗагрузкиНастроек(ИмяВыбранногоФайла);
		
	УстановитьЗаголовок();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция СохранитьНастройкуВФайл(ИмяВыбранногоФайла) Экспорт 
	
	Если ИмяВыбранногоФайла = Неопределено Тогда 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Адрес = ПолучитьАдресФайлаНастроек();	
	ПолучитьФайл(Адрес, ИмяВыбранногоФайла, Ложь);
	УдалитьИзВременногоХранилища(Адрес);
	
	ПослеСохраненияИлиЗагрузкиНастроек(ИмяВыбранногоФайла);
	
	ПоказатьОповещениеПользователя("Настройки сохранены", , ИмяФайлаНастроек);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьНастройки()
	
	ПараметрыТекущейНастройки = Неопределено;
	
	Настройки_Дерево.ПолучитьЭлементы().Очистить();
	Настройки_Алгоритмы.Очистить();
	Настройки_Запросы.Очистить();
	
	ПослеСохраненияИлиЗагрузкиНастроек(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияИлиЗагрузкиНастроек(ИмяФайла)
	
	Модифицированность = Ложь;
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда 
		
		Файл = Новый Файл(ИмяФайла);
		ИмяФайлаНастроек = ИмяФайла;
		ПутьФайлаЗапроса = Файл.Путь;
		
	Иначе
		
		ИмяФайлаНастроек = Неопределено;
		ПутьФайлаЗапроса = Неопределено;
		
	КонецЕсли;
	
	УстановитьЗаголовок();
	
КонецПроцедуры

#КонецОбласти //Настройки

#Область Редактор

&НаКлиенте
Процедура Редактор_Раскомментировать(Команда)
	РасКомментироватьВыделенныйТекст();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросСкрипт(Команда)
	
	СохранитьДанныеНастройки(ПараметрыТекущейНастройки);
	
	Если НЕ МожноВыполнить() Тогда 
		Возврат;
	КонецЕсли;
	
	ВыполнитьНастройку(ПараметрыТекущейНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекстДляМодуля(Команда)
	
	ТекстДок = СформироватьТекстДляМодуля(ВыбраннаяНастройка_Текст.ПолучитьТекст());
	
	ТекстДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекстЗапросаОтМусора()
	
	ВыбраннаяНастройка_Текст.УстановитьТекст(обПропылесоситьТекстЗапроса(ВыбраннаяНастройка_Текст.ПолучитьТекст()));
	
КонецПроцедуры // ОчиститьТекстЗапросаОтМусора()

&НаКлиенте
Процедура Редактор_ОткрытьКонструкторЗапроса(Команда)
	
	ТекстЗапроса = ВыбраннаяНастройка_Текст.ПолучитьТекст();
	Контсруктор = Новый КонструкторЗапроса(?(ПустаяСтрока(ТекстЗапроса) ,Неопределено, ТекстЗапроса));

	Контсруктор.Показать(Новый ОписаниеОповещения("ПриЗакрытииКЗ", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура Редактор_Закомментировать(Команда)
	ЗакомментироватьВыделенныйТекст();
КонецПроцедуры

&НаКлиенте
Процедура Параметры_Заполнить(Команда)
	Параметры_ЗаполнитьНаКлиенте();
КонецПроцедуры

#КонецОбласти //Редактор

#Область Таблица_результат

&НаКлиенте
Процедура Таблица_НастроитьКолонки(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПрименитьНастройкиТаблицы", ЭтаФорма);
	ОткрытьФорму("ВнешняяОбработка.КонсольКода83.Форма.ФормаНастройкаТаблицы", Новый Структура("Данные", СтруктураТаблицы), ЭтаФорма, , , ,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Результат_ДобавитьВПараметры(Команда)
	Значение = ЗначениеТекущейЯчейки();
	
	ИмяПараметра = Элементы.РезультатТаблица.ТекущийЭлемент.Заголовок;
	
	УстановитьЗначениеПараметра(ИмяПараметра, Значение);
КонецПроцедуры

#КонецОбласти //Таблица_результат

&НаКлиенте
Процедура ПереключитьВидимость(Команда)
	Элемент = Неопределено;
	Кнопка = Неопределено;
	
	ИзменяемыеЭлементы = Новый Массив;
	
	Если Команда.Имя = "Видимость_Дерево_Настроек" Тогда 
		Элемент = Элементы.Настройки_Дерево;
		ИзменяемыеЭлементы.Добавить(Элемент);
		ИзменяемыеЭлементы.Добавить(Элементы.Настройки_ДеревоГруппаДобавить);
		Кнопка = Элементы.Видимость_Дерево_Настроек;
	ИначеЕсли Команда.Имя = "Видимость_Параметры" Тогда 
		Элемент = Элементы.ГруппаСтранницыПараметры;
		ИзменяемыеЭлементы.Добавить(Элемент);
		Кнопка = Элементы.Видимость_Параметры;
	КонецЕсли;
	
	ВидимостьНовая = НЕ Элемент.Видимость;
	
	Для Каждого Эл Из ИзменяемыеЭлементы Цикл 
		Эл.Видимость = ВидимостьНовая;
	КонецЦикла;
	
	Кнопка.Пометка = ВидимостьНовая;
	//Кнопка.ЦветФона = ?(Элемент.Видимость, WebЦвета.Белый, WebЦвета.Серебряный);
КонецПроцедуры

#Область  Дерево_настроек
&НаКлиенте
Процедура Настройки_ДобавитьНастройку(Команда)
	
	Если Команда.Имя = "Настройки_ДобавитьЗапрос" Тогда 
		Тип = 0;
	ИначеЕсли Команда.Имя = "Настройки_ДобавитьСкрипт" Тогда 
		Тип = 1;
	ИначеЕсли Команда.Имя = "Настройки_ДобавитьГруппу" Тогда 
		Тип = 9;
	КонецЕсли;
	
	Если Тип= Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДобавитьНастройку(Тип);
	
КонецПроцедуры

#КонецОбласти //Дерево_настроек

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ДеревоНастроекПриАктивизацииСтроки(Элемент)
	
	Если ТекущаяНастройка = Элементы.ДеревоНастроек.ТекущиеДанные Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ?(Элементы.ДеревоНастроек.ТекущиеДанные=Неопределено, Неопределено, Элементы.ДеревоНастроек.ТекущиеДанные.ТекстЗапроса);
	ТекущаяНастройка = Элементы.ДеревоНастроек.ТекущиеДанные;
КонецПроцедуры

&НаКлиенте
Процедура СохраняемыеДанныеПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПараметрыЗапросаПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Элементы.ДеревоНастроекПараметрыЗапросаЗначениеПараметра.ОграничениеТипа = Элемент.ТекущиеДанные.ТипПараметра;
КонецПроцедуры

&НаКлиенте
Процедура РезультатТаблицаПриАктивизацииЯчейки(Элемент)
	ПодключитьОбработчикОжидания("ВывестиОписаниеЗначенияТаблицы", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РезультатТаблицаПриИзменении(Элемент)
	ТаблицаИзменена = Истина;
КонецПроцедуры

#КонецОбласти //События_элементов_формы

#Область Таблица_результата

&НаКлиенте
Функция ЗначениеТекущейЯчейки()
	Элемент = Элементы.РезультатТаблица;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Элемент.ТекущиеДанные[ИмяТекущейКолонки()];
	
КонецФункции

&НаКлиенте
Функция ИмяТекущейКолонки()
	
	Возврат Элементы.РезультатТаблица.ТекущийЭлемент.Заголовок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСвойстваЗначения(Значение)
	
	Результат = Новый Структура("Выполнено, Описание", Истина);
	
	ТипЗначения = ТипЗнч(Значение);
	
	Описание = Новый СписокЗначений;
	
	Результат.Вставить("ОписаниеЗначения", Описание);
	
	Если НЕ ОписаниеТиповВсеСсылки().СодержитТип(ТипЗначения) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Описание.Добавить(Значение.УникальныйИдентификатор(), "UID");
	Исключение
	КонецПопытки;
	
	ЗначениеЗаполнено = ЗначениеЗаполнено(Значение);
	
	Попытка
		Мета = Метаданные.НайтиПоТипу(ТипЗначения);
		
		Если ЗначениеЗаполнено И Метаданные.Перечисления.Содержит(Мета) Тогда 
			
			Порядок = ЗначениеЗапросом("ВЫБРАТЬ " + Мета.ПолноеИмя() + ".Порядок ГДЕ Ссылка = &Ссылка", Новый Структура("Ссылка", Значение));
			МетаЗначение = Мета.ЗначенияПеречисления[Порядок];
			Описание.Добавить(Мета.ПолноеИмя() + "." + МетаЗначение.Имя, "Полное имя");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено И Метаданные.Справочники.Содержит(Мета)
			ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(Мета)
			ИЛИ Метаданные.ПланыСчетов.Содержит(Мета)
			ИЛИ Метаданные.ПланыВидовРасчета.Содержит(Мета) Тогда 
			
			ИмяПредопределенного = ЗначениеЗапросом("ВЫБРАТЬ " + Мета.ПолноеИмя() + ".ИмяПредопределенныхДанных ГДЕ Ссылка = &Ссылка", Новый Структура("Ссылка", Значение));
			
			Если ЗначениеЗаполнено(ИмяПредопределенного) Тогда 
				Описание.Добавить(Мета.ПолноеИмя() + "." + ИмяПредопределенного, "Полное имя");
			КонецЕсли;
			
		КонецЕсли;		
	Исключение
		
		Возврат мОшибка(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВывестиОписаниеЗначенияТаблицы()
	
	Значение = ЗначениеТекущейЯчейки();
	
	Если Значение = Неопределено Тогда 
		Служебные_ОписаниеТекущегоЗначения = Неопределено;
		Возврат;
	КонецЕсли;
	
	
	// Костыль от зацикливания
	Если ХранилищеПараметров.Свойство("ТекущееЗначениеТаблицы") И Значение = ХранилищеПараметров.ТекущееЗначениеТаблицы Тогда 
		Возврат;
	КонецЕсли;
	
	ХранилищеПараметров.Вставить("ТекущееЗначениеТаблицы", Значение);
	
	Описание = Новый СписокЗначений;	
	
	Описание.Добавить(Значение, "Значение");
	Описание.Добавить(ПолучитьПолноеИмяТипа(ТипЗнч(Значение)), "Тип");
	
	ХранилищеПараметров.Вставить("ТекущееЗначениеТаблицы_Описание", Описание);
	
	Служебные_ОписаниеТекущегоЗначения = ФорматированноеОписаниеСписок(Описание);
	
КонецПроцедуры

&НаКлиенте
Процедура Служебные_ОписаниеТекущегоЗначенияНажатие(Элемент, СтандартнаяОбработка)
	
	Если НЕ ХранилищеПараметров.Свойство("ТекущееЗначениеТаблицы_Описание") Тогда 
		Возврат;
	КонецЕсли;
	
	// Не дополненное описание	
	Если ХранилищеПараметров.ТекущееЗначениеТаблицы_Описание.Количество() = 2 Тогда 
		
		ХранилищеПараметров.ТекущееЗначениеТаблицы_Описание.Добавить(ИмяТекущейКолонки(), "Имя реквизита");
		Результат = ПолучитьСвойстваЗначения(ХранилищеПараметров.ТекущееЗначениеТаблицы_Описание[0].Значение);
		
		Если НЕ Результат.Выполнено Тогда 
			СообщитьОбОшибке(Результат.Описание, "Получение описания значения");
			Возврат;
		КонецЕсли;
		
		Скопировать(Результат.ОписаниеЗначения, ХранилищеПараметров.ТекущееЗначениеТаблицы_Описание);
				
	КонецЕсли;
		
	ОткрытьФорму(ИмяФормы + "Свойств", 
			Новый Структура("Список", ХранилищеПараметров.ТекущееЗначениеТаблицы_Описание), 
			ЭтаФорма, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьНастройкиТаблицы(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда 
		
		СтруктураТаблицы = ПрименитьНастройкиТаблицыСервер(Результат);
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Функция ПрименитьНастройкиТаблицыСервер(СтруктураТаблицы)

	Таблица = РеквизитФормыВЗначение("РезультатТаблица");
	
	НовыеКолонки = Новый Массив;
	УдаляемыеКолонки = Новый Массив;
	ИзмененныеКолонки = Новый Массив;
	
	ИндексКолонок = Новый Структура;
	
	Для Каждого Колонка Из СтруктураТаблицы Цикл 
		ИндексКолонок.Вставить(Колонка.Имя, Колонка);
		
		КолонкаТаблицы = Таблица.Колонки.Найти(Колонка.Имя);
		Если КолонкаТаблицы = Неопределено Тогда 
			НовыеКолонки.Добавить(Колонка);			
		ИначеЕсли КолонкаТаблицы.ТипЗначения <> Колонка.ТипЗначения Тогда 
			ИзмененныеКолонки.Добавить(Колонка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого КолонкаТаблицы Из Таблица.Колонки Цикл 
		
		Колонка = ИндексКолонок[Колонка.Имя];
		
		Если Колонка = Неопределено Тогда 
			
			УдаляемыеКолонки.Добавить(КолонкаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Колонка Из НовыеКолонки Цикл 
		
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок);
		
	КонецЦикла;
	
	Для Каждого Колонка Из УдаляемыеКолонки Цикл 
		
		Таблица.Колонки.Удалить(Колонка);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Таблица, РезультатТаблица_Адрес);

	Возврат ВывестиТаблицу(Таблица);
	
КонецФункции

#КонецОбласти //Таблица_результата

#Область  Дерево_настроек

&НаКлиенте
Процедура УстановитьНастройкиИнфтерфейса(ПараметрыНастройки)
	
	ИспользоватьРедактор = ПараметрыНастройки <> Неопределено И (ПараметрыНастройки.Тип = 0 ИЛИ ПараметрыНастройки.Тип = 1);
	Если ИспользоватьРедактор И ПараметрыНастройки.Тип = 0 Тогда 
		
		Элементы.ГруппаКоманды.ТекущаяСтраница = Элементы.ГруппаЗапрос;
		
	ИначеЕсли ИспользоватьРедактор И ПараметрыНастройки.Тип = 1 Тогда 
	
		Элементы.ГруппаКоманды.ТекущаяСтраница = Элементы.ГруппаСкрипт;
		
	КонецЕсли;
		
	Элементы.ГруппаРедактор.Доступность = ИспользоватьРедактор;
	Элементы.ТекстЗапросаКонтекстноеМенюОткрытьКонструкторЗапроса.Доступность = ИспользоватьРедактор И ПараметрыНастройки.Тип = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки_ДеревоПриАктивизацииСтроки(Элемент)
	
	СохранитьДанныеНастройки(ПараметрыТекущейНастройки);
	
	КлючТекущейНастройки = ?(Элементы.Настройки_Дерево.ТекущиеДанные = Неопределено, Неопределено, Элементы.Настройки_Дерево.ТекущиеДанные.Ключ);
	
	ПараметрыТекущейНастройки = ПолучитьПараметрыНастройки(КлючТекущейНастройки);
	
	УстановитьНастройкиИнфтерфейса(ПараметрыТекущейНастройки);
	ОтобразитьДанныеНастройки(ПараметрыТекущейНастройки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КартинкаПоТипуНастройки(Тип)
	Если Тип = 0 Тогда 
		
		Возврат БиблиотекаКартинок.КонструкторЗапроса;
		
	ИначеЕсли Тип = 1 Тогда 
		
		Возврат БиблиотекаКартинок.ПроизвольноеВыражение;
		
	ИначеЕсли Тип = 9 Тогда 
		
		Возврат БиблиотекаКартинок.ВнешнийИсточникДанныхКуб;
		
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Результат_ВременныеТаблицыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Результат_ВременныеТаблицы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(ТекущиеДанные.АдресДанных) Тогда 
		ЗагрузитьТаблицу(ТекущиеДанные.АдресДанных);
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти //Дерево_настроек

