&НаКлиенте
Перем БиблиотекаМетодов;

&НаКлиенте
Процедура Инициализировать(пБиблиотекаМетодов) Экспорт 
	
	БиблиотекаМетодов = пБиблиотекаМетодов;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Значение = Параметры.Граница;
	
	Дата = Значение.Значение;
	ВидГраницы = Значение.ВидГраницы;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СтрокаXML = СтрШаблон(
	"<Bound xmlns=""http://v8.1c.ru/8.1/data/enterprise"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"">
	|	<value xsi:type=""xs:dateTime"">%1</value>
	|	<kind>%2</kind>
	|</Bound>", СериализаторXDTO.XMLСтрока(Дата), ?(ВидГраницы = "Включая", 0, 1));
	
	Значение = БиблиотекаМетодов.XMLСтрокаВЗначение(СтрокаXML, Тип("Граница"));
	
	Закрыть(Значение);
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры
