&НаКлиенте
Процедура ПриступимКОтладке(Команда)
	
	Закрыть(Новый Структура("Адрес, НеУдалятьИзХранилища", Адрес, НеУдалятьИзХранилища));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	РежимЗапроса = "Запрос";
	РежимЗапросаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗапросаПриИзменении(Элемент)

	Метод = "";
	Если РежимЗапроса = "Запрос" Тогда 
		Метод = "ПоместитьЗапрос(Запрос";
	ИначеЕсли РежимЗапроса = "СКД" Тогда 
		Метод = "ПоместитьЗапросСКД(Схема, Настройки";
	ИначеЕсли РежимЗапроса = "ДинамоСписок" Тогда 
		Метод = "ПоместитьЗапросДС(Элементы.Список";
	Иначе
		ВызватьИсключение "Неизвестный режим";
	КонецЕсли;
	
	ТекстСкрипта = СтрШаблон(
		"ВнешниеОбработки.Создать(""CodeConsole83"").%1, Новый УникальныйИдентификатор(""%2""))" 
	    , Метод
		, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор
	);
	
КонецПроцедуры
