
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Данные") Тогда 
		
		Для Каждого Стр Из Параметры.Данные Цикл 
			
			ЗаполнитьЗначенияСвойств(РеквизитыТаблицы.Добавить(), Стр);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Результат = Новый Массив;
	
	Для Каждого Стр Из РеквизитыТаблицы Цикл 
		
		Структура = Новый Структура("Имя, ТипЗначения, Заголовок");
		ЗаполнитьЗначенияСвойств(Структура, Стр);
		Результат.Добавить(Структура);
		
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры
