Функция ОписаниеПлагина() Экспорт 
	
	Описание = Новый Структура;
	Описание.Вставить("Ключ", "CSVСериализатор");
	Описание.Вставить("Представление", "CSV сериализатор");
	Описание.Вставить("Функциональность", Новый Массив);
	
	Описание.Функциональность.Добавить("Сериализация");
	
	Возврат Описание;
	
КонецФункции // ОписаниеПлагина

Функция ПолучитьФорматыСериализации(Тип) Экспорт 

	Форматы = Новый Соответствие;
	Форматы.Вставить("*.csv", "*.csv");
	Форматы.Вставить("*.tsv", "*.tsv");
	
	Возврат Форматы;

КонецФункции // ПолучитьФорматыСериализации()

Функция ЕстьПоддержкаСериализации(Тип, Формат) Экспорт 
	
	Возврат Тип = Тип("ТаблицаЗначений") И (ВРег(Формат) = "CSV" ИЛИ ВРег(Формат) = "TSV");
	
КонецФункции // ЕстьПоддержкаСериализации

Функция СохранитьЗначение(Значение, Формат) Экспорт
	
	Запись = Новый ТекстовыйДокумент;
	
	КолвоКолонок = Значение.Колонки.Количество() - 1;
	Для Каждого Строка Из Значение Цикл 
		
		СтрБуфер = Неопределено;
		
		Для Инд = 0 По КолвоКолонок Цикл 
			
			Если СтрБуфер = Неопределено Тогда
				СтрБуфер = Строка(Строка[Инд]);
			Иначе
				СтрБуфер = СтрБуфер + "," + Строка(Строка[Инд]);
			КонецЕсли; 
		КонецЦикла;
		
		Запись.ДобавитьСтроку(СтрБуфер);
		
	КонецЦикла;
	
	Возврат Запись.ПолучитьТекст();

КонецФункции // СохранитьЗначение()

Функция ЗагрузитьЗначение(Строка, Формат, Тип) Экспорт 
	
	
	Если ТипЗнч(Строка) = Тип("Строка") Тогда
		
		Поток = Новый ПотокВПамяти;
		Запись = Новый ЗаписьДанных(Поток);
		Запись.ЗаписатьСтроку(Строка);
		Запись.Закрыть();
		
		Поток.Перейти(0, ПозицияВПотоке.Начало);
		
		Чтение = Новый ЧтениеТекста(Поток);
		
	ИначеЕсли ТипЗнч(Строка) = Тип("ДвоичныеДанные") Тогда 
		
		Чтение = Новый ЧтениеТекста(Строка.ОткрытьПотокДляЧтения());
	
	КонецЕсли;
	
	Таблица = Новый ТаблицаЗначений;
	
	Пока Истина Цикл 
		
		Строка = Чтение.ПрочитатьСтроку();
		
		Если Строка = Неопределено Тогда 
			
			Прервать;
			
		КонецЕсли;
		
		Значения = СтрРазделить(Строка, ",", Истина);
		
		Пока Таблица.Колонки.Количество() < Значения.Количество() Цикл 
			
			Таблица.Колонки.Добавить("Колонка" + (Таблица.Колонки.Количество() + 1), Новый ОписаниеТипов("Строка"));
			
		КонецЦикла;
		
		СтрТаблицы = Таблица.Добавить();
		
		Для инд = 0 по Значения.Количество() - 1 Цикл 
			
			СтрТаблицы[инд] = Значения[инд];
			
		КонецЦикла;
		
	КонецЦикла;
	
	Чтение.Закрыть();
	
	Возврат Таблица;

КонецФункции // ЗагрузитьЗначение
